In [ ]:
# https://github.com/mrdbourke/zero-to-mastery-ml/blob/master/section-2-data-science-and-ml-tools/pandas-exercises.ipynb
import pandas as pd

In [ ]:
colors = pd.Series(["Red", "Yellow", "Blue"])

In [ ]:
colors

In [ ]:
cars = pd.Series(["Vw", "Honda", "Toyota"])
cars

In [ ]:
df = pd.DataFrame({
    "Cars": cars,
    "Colors": colors
})

In [ ]:
df

In [ ]:
car_sales = pd.read_csv("7.1 car-sales.csv")
car_sales

In [ ]:
df.to_csv("My-car-csv.csv")

In [ ]:
car_sales.info()

In [ ]:
car_sales.describe()

In [ ]:
car_sales.dtypes

In [ ]:
fuel_economy = [7.5, 5.6, 4.7, 9.0, 8.5, 9.5, 7.7, 3.0, 5.5, 4.0]
car_sales["Fuel economy"] = fuel_economy

In [ ]:
car_sales

In [ ]:
car_sales["Fuel economy"].mean()

In [ ]:
car_sales["Fuel economy"].sum()

In [ ]:
list(car_sales)

In [ ]:
len(car_sales)

In [ ]:
car_sales.loc[:4]car

In [ ]:
car_sales[:6]

In [ ]:
car_sales.tail(5)

In [ ]:
car_sales.iloc[3]

In [ ]:
car_sales["Odometer (KM)"].mean()

In [ ]:
highest_odometer = car_sales[car_sales["Odometer (KM)"] > 100000]

In [ ]:
highest_odometer

In [ ]:
car_sales.crosstab(["Doors", "Make"])

In [ ]:
pd.crosstab(car_sales["Make"], car_sales["Doors"])

In [ ]:
grouped_data = car_sales.groupby("Make")

In [ ]:
grouped_data.mean() # ERROR

In [ ]:
car_sales["Odometer (KM)"].plot()

In [ ]:
car_sales["Odometer (KM)"].hist()

In [ ]:
car_sales["Price"] = (car_sales["Price"].replace("[\$\,\.]", "", regex=True).astype(int)) // 100

In [ ]:
car_sales["Price"].info()

In [ ]:
car_sales.Price.plot()

In [ ]:
car_sales.rename(str.lower, axis="columns")

In [25]:
missing_data = pd.read_csv("9.2 car-sales-missing-data.csv")
missing_data

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500
5  Toyota  Green       NaN    4.0   $4,500
6   Honda    NaN       NaN    4.0   $7,500
7   Honda   Blue       NaN    4.0      NaN
8  Toyota  White   60000.0    NaN      NaN
9     NaN  White   31600.0    4.0   $9,700

In [26]:
missing_data["Odometer"].fillna(missing_data["Odometer"].mean(), inplace=True)

In [27]:
missing_data

     Make Colour       Odometer  Doors    Price
0  Toyota  White  150043.000000    4.0   $4,000
1   Honda    Red   87899.000000    4.0   $5,000
2  Toyota   Blue   92302.666667    3.0   $7,000
3     BMW  Black   11179.000000    5.0  $22,000
4  Nissan  White  213095.000000    4.0   $3,500
5  Toyota  Green   92302.666667    4.0   $4,500
6   Honda    NaN   92302.666667    4.0   $7,500
7   Honda   Blue   92302.666667    4.0      NaN
8  Toyota  White   60000.000000    NaN      NaN
9     NaN  White   31600.000000    4.0   $9,700

In [28]:
missing_data.dropna(inplace=True)
missing_data

     Make Colour       Odometer  Doors    Price
0  Toyota  White  150043.000000    4.0   $4,000
1   Honda    Red   87899.000000    4.0   $5,000
2  Toyota   Blue   92302.666667    3.0   $7,000
3     BMW  Black   11179.000000    5.0  $22,000
4  Nissan  White  213095.000000    4.0   $3,500
5  Toyota  Green   92302.666667    4.0   $4,500

In [29]:
missing_data["Seats"] = 5

In [30]:
missing_data

     Make Colour       Odometer  Doors    Price  Seats
0  Toyota  White  150043.000000    4.0   $4,000      5
1   Honda    Red   87899.000000    4.0   $5,000      5
2  Toyota   Blue   92302.666667    3.0   $7,000      5
3     BMW  Black   11179.000000    5.0  $22,000      5
4  Nissan  White  213095.000000    4.0   $3,500      5
5  Toyota  Green   92302.666667    4.0   $4,500      5

In [31]:
engine_size = [1.3, 1.4, 1.6, 1.8, 2.0, 4.8]
missing_data["Engine size"] = engine_size

In [32]:
missing_data

     Make Colour       Odometer  Doors    Price  Seats  Engine size
0  Toyota  White  150043.000000    4.0   $4,000      5          1.3
1   Honda    Red   87899.000000    4.0   $5,000      5          1.4
2  Toyota   Blue   92302.666667    3.0   $7,000      5          1.6
3     BMW  Black   11179.000000    5.0  $22,000      5          1.8
4  Nissan  White  213095.000000    4.0   $3,500      5          2.0
5  Toyota  Green   92302.666667    4.0   $4,500      5          4.8

In [33]:
price_km_in_dollars = [1, 1.5, 2, 2.5, 3, 5.5]
missing_data["Km price ($)"] = price_km_in_dollars
missing_data

,Make,Colour,Odometer,Doors,Price,Seats,Engine size,Km price ($)
0,Toyota,White,150043.000000,4.0,"$4,000",5,1.3,1.0
1,Honda,Red,87899.000000,4.0,"$5,000",5,1.4,1.5
2,Toyota,Blue,92302.666667,3.0,"$7,000",5,1.6,2.0
3,BMW,Black,11179.000000,5.0,"$22,000",5,1.8,2.5
4,Nissan,White,213095.000000,4.0,"$3,500",5,2.0,3.0
5,Toyota,Green,92302.666667,4.0,"$4,500",5,4.8,5.5

In [34]:
missing_data.drop("Km price ($)", axis=1, inplace=True)
missing_data

     Make Colour       Odometer  Doors    Price  Seats  Engine size
0  Toyota  White  150043.000000    4.0   $4,000      5          1.3
1   Honda    Red   87899.000000    4.0   $5,000      5          1.4
2  Toyota   Blue   92302.666667    3.0   $7,000      5          1.6
3     BMW  Black   11179.000000    5.0  $22,000      5          1.8
4  Nissan  White  213095.000000    4.0   $3,500      5          2.0
5  Toyota  Green   92302.666667    4.0   $4,500      5          4.8

In [49]:
shuffle_data = missing_data.sample(frac=1, ignore_index=True)
shuffle_data

     Make Colour       Odometer  Doors    Price  Seats  Engine size
0   Honda    Red   87899.000000    4.0   $5,000      5          1.4
1  Nissan  White  213095.000000    4.0   $3,500      5          2.0
2  Toyota  Green   92302.666667    4.0   $4,500      5          4.8
3     BMW  Black   11179.000000    5.0  $22,000      5          1.8
4  Toyota   Blue   92302.666667    3.0   $7,000      5          1.6
5  Toyota  White  150043.000000    4.0   $4,000      5          1.3

In [56]:
car_sales = pd.read_csv("7.1 car-sales.csv")
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [57]:
car_sales["Odometer (KM)"] = car_sales["Odometer (KM)"] * 0.62
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White       93026.66      4   $4,000.00
1   Honda    Red       54497.38      4   $5,000.00
2  Toyota   Blue       20180.38      3   $7,000.00
3     BMW  Black        6930.98      5  $22,000.00
4  Nissan  White      132118.90      4   $3,500.00
5  Toyota  Green       61512.06      4   $4,500.00
6   Honda   Blue       28332.76      4   $7,500.00
7   Honda   Blue       33937.56      4   $7,000.00
8  Toyota  White       37200.00      4   $6,250.00
9  Nissan  White       19592.00      4   $9,700.00

In [58]:
car_sales.rename(columns={"Odometer (KM)": "Odometer (M)"})

     Make Colour  Odometer (M)  Doors       Price
0  Toyota  White      93026.66      4   $4,000.00
1   Honda    Red      54497.38      4   $5,000.00
2  Toyota   Blue      20180.38      3   $7,000.00
3     BMW  Black       6930.98      5  $22,000.00
4  Nissan  White     132118.90      4   $3,500.00
5  Toyota  Green      61512.06      4   $4,500.00
6   Honda   Blue      28332.76      4   $7,500.00
7   Honda   Blue      33937.56      4   $7,000.00
8  Toyota  White      37200.00      4   $6,250.00
9  Nissan  White      19592.00      4   $9,700.00